{
  "Unit 2": {
    "Oral Communication": {
      "Definition": "Oral communication means sharing information by speaking. It is the fastest way to exchange ideas and feelings.",
      "Examples": ["Talking to a friend", "Classroom discussion", "Phone call"]
    },
    "Nature & Scope": {
      "Nature": [
        "It is face-to-face or through voice (phone, meeting, etc.)",
        "Quick, direct, and personal way of communication"
      ],
      "Scope": [
        "Used in meetings",
        "Interviews",
        "Group discussions",
        "Presentations",
        "Classrooms"
      ],
      "Examples": ["Teacher explaining a lesson", "Manager giving instructions"]
    },
    "Principles of Effective Oral Communication": [
      "Clarity – Use simple, understandable language",
      "Brevity – Be short and direct",
      "Proper Tone – Use polite and suitable voice",
      "Confidence – Speak with self-assurance",
      "Listening – Pay attention to the other person",
      "Appropriate Language – Avoid harsh or technical words",
      "Feedback – Encourage response and check understanding",
      "Body Language – Maintain eye contact, gestures, and posture"
    ],
    "Techniques of Effective Speech": [
      "Clarity of Voice – Speak clearly and loudly enough",
      "Proper Pronunciation – Use correct words and sounds",
      "Confidence – Speak without hesitation",
      "Simple Language – Avoid difficult or complex words",
      "Good Body Language – Use eye contact and natural gestures",
      "Proper Speed & Pause – Don’t speak too fast or too slow",
      "Audience Awareness – Speak according to the listener’s level"
    ],
    "Media of Oral Communication": {
      "Face-to-Face Conversation": "Direct talk between two or more people. Example: Talking with a friend",
      "Teleconference": "Telephone/video communication with many people. Example: Zoom call",
      "Press Conference": "Meeting with journalists. Example: Minister announcing new policy",
      "Demonstration": "Showing how something works. Example: Teacher showing science experiment",
      "Radio Recording": "Message shared through radio programs. Example: News bulletin",
      "Dictaphone": "Recording spoken words for later use. Example: Boss recording notes",
      "Meetings": "Group of people discussing ideas. Example: Office staff meeting",
      "Rumour": "Unofficial, unverified talk. Example: Gossip about exam dates",
      "Dramatisation": "Acting out to explain ideas. Example: Street play on social issues",
      "Public Address System": "Speaking to large groups with mic/loudspeaker. Example: Principal’s announcement",
      "Grapevine": "Informal network of communication. Example: Office gossip chain",
      "Group Discussion": "Exchange of ideas among members. Example: Students discussing a project",
      "Oral Report": "Presenting information verbally. Example: Student giving class report",
      "Closed Circuit TV (CCTV/Video Talk)": "Message shown to limited audience on screen. Example: Training through CCTV"
    },
    "The Art of Listening": {
      "Definition": "Listening means hearing with full attention and understanding.",
      "Requirements": [
        "Concentration",
        "Patience",
        "Interest in the speaker’s words"
      ],
      "Benefits": [
        "Avoids confusion",
        "Improves relationships"
      ],
      "Example": "A student listening carefully to a teacher’s lecture"
    },
    "Principles of Good Listening": [
      "Attention – Focus fully on the speaker",
      "Patience – Don’t interrupt or finish their sentences",
      "Open Mind – Avoid judging before listening completely",
      "Understanding – Try to grasp the real meaning",
      "Feedback – Respond or ask questions politely",
      "Avoid Distractions – No mobile or side-talks"
    ]
  }
}

